scales:
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']]   # 0
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]   # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]   # 2
  - [-1, 1, nn.MaxPool2d,  [3, 2, 1]]                         # 3

  - [-1, 1, Blocks, [64,  PConv_Block, 2, 2, 'relu']]         # 4  /4
  - [-1, 1, Blocks, [128, PConv_Block, 2, 3, 'relu']]         # 5  /8   P3
  - [-1, 1, Blocks, [256, PConv_Block, 2, 4, 'relu']]         # 6  /16  P4
  - [-1, 1, Blocks, [512, SFDConv,     1, 5, 'relu']]         # 7  /32  P5

head:
  # P5 -> AIFI
  - [7, 1, GSConv, [256, 1, 1, None, 1, 1, False]]            # 8   P5 proj
  - [-1, 1, AIFI, [2048, 8]]                                  # 9   AIFI
  - [-1, 1, GSConv, [256, 1, 1]]                              # 10  F5


  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                # 11  up(F5)
  - [6,  1, GSConv, [256, 1, 1, None, 1, 1, False]]           # 12  P4 proj
  - [[12, 11], 1, Fusion, ['fusion_mode']]                    # 13  P4 fusion
  - [-1, 3, VoVGSCSP, [256]]                                  # 14  Y4_pre
  - [-1, 1, HiLo, [8, False, None, 0.0, 0.0, 2, 0.5]]         # 15  Y4_hilo
  - [-1, 1, GSConv, [256, 1, 1]]                              # 16  Y4


  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]                # 17  up(Y4)
  - [5,  1, GSConv, [256, 1, 1, None, 1, 1, False]]           # 18  P3 proj
  - [[18, 17], 1, Fusion, ['fusion_mode']]                    # 19  P3 fusion
  - [-1, 3, VoVGSCSP, [256]]                                  # 20  X3


  - [-1, 1, GSConv, [256, 3, 2]]                              # 21  down(X3)
  - [[21, 16], 1, Fusion, ['fusion_mode']]                    # 22  P4 bottom-up fusion
  - [-1, 3, VoVGSCSP, [256]]                                  # 23  F4


  - [-1, 1, GSConv, [256, 3, 2]]                              # 24  down(F4)
  - [[24, 10], 1, Fusion, ['fusion_mode']]                    # 25  P5 bottom-up fusion
  - [-1, 3, VoVGSCSP, [256]]                                  # 26  F5_out


  - [[20, 23, 26], 1, ScalSeq, [256]]                         # 27
  - [[20, 27], 1, Add, []]                                    # 28  O3

  # -------- RTDETR head --------
  - [[28, 23, 26], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]] # 29
